SaitovSP/src/InformationRegisters/Сертификаты/Сертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сертификаты</name>
  <resources>
    <name>СуммаСертификата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеиспользованнаяСуммаСертификата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Погашен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/InformationRegisters/Сертификаты/ManagerModule.bsl
Процедура ЗарегистрироватьСертификат(ТекущийОбъект) Экспорт

	НаборЗаписей = РегистрыСведений.Сертификаты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сертификат.Установить(ТекущийОбъект.СертификатОплаты);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись 					 = НаборЗаписей.Добавить();
	Запись.Период			 = ОбщийСервер.ДатаВыдачиСертификата(ТекущийОбъект.СертификатОплаты);
	Запись.Сертификат 		 = ТекущийОбъект.СертификатОплаты;
	Запись.СуммаСертификата	 = СуммаСертификата;
	Запись.Погашен			 = Истина;
		
		///Если сертификат был применен то и равен сумме заказа то он будет 0
	Если Объект.Итого = 0 Тогда
		Запись.СуммаЗаказа	 = СуммаСертификата;
	Иначе
		Запись.СуммаЗаказа	 = ТекущийОбъект.Итого;
	КонецЕсли;

	Если СуммаСертификата > ТекущийОбъект.Итого Тогда
		Запись.НеиспользованнаяСуммаСертификата 	= СуммаСертификата - ТекущийОбъект.Итого;
	Иначе
		Запись.НеиспользованнаяСуммаСертификата 	= 0;
	КонецЕсли;

	НаборЗаписей.Записать();	

КонецПроцедуры
